Term4/discrete/hw/56.org
#+LATEX_CLASS: general
#+TITLE: 56
#+AUTHOR: Ilya Yaroshevskiy

- \(B_1\)
  \-
  #+begin_export latex
  \begin{center}
  \begin{tikzpicture}
  \draw[dashed] (0, 0, 0) -- (0, 1, 0);
  \draw[dashed] (0, 0, 0) -- (0, 0, 2);
  \draw[dashed] (0, 0, 0) -- (2, 0, 0);
  \draw (0, 1, 0) -- (2, 1, 0);
  \draw (0, 1, 0) -- (0, 1, 2);
  \draw (0, 1, 2) -- (0, 0, 2);
  \draw (0, 0, 2) -- (2, 0, 2);
  \draw (2, 0, 2) -- (2, 1, 2);
  \draw (2, 1, 2) -- (0, 1, 2);
  \draw (2, 1, 2) -- (2, 1, 0);
  \draw (2, 0, 2) -- (2, 0, 0);
  \draw (2, 0, 0) -- (2, 1, 0);
  \draw[dashed] (1, 0, 0) -- (1, 1, 0);
  \draw[dashed] (1, 0, 0) -- (1, 0, 2);
  \draw (1, 0, 2) -- (1, 1, 2);
  \draw (1, 1, 2) -- (1, 1, 0);
  \end{tikzpicture}
  \end{center}
  #+end_export

- \(B_2\)
  \-
  #+begin_export latex
  \begin{center}
  \begin{tikzpicture}
  \draw[dashed] (0, 0, 0) -- (0, 2, 0);
  \draw[dashed] (0, 0, 0) -- (0, 0, 2);
  \draw[dashed] (0, 0, 0) -- (2, 0, 0);
  \draw (0, 2, 0) -- (0, 2, 2) -- (0, 0, 2) -- (2, 0, 2) -- (2, 0, 0) -- (2, 2, 0) -- (0, 2, 0);
  \draw (2, 2, 2) -- (2, 0 , 2);
  \draw (2, 2, 2) -- (0, 2 , 2);
  \draw (2, 2, 2) -- (2, 2 , 0);
  \draw[dashed] (1, 0, 0) -- (1, 2, 0);
  \draw[dashed] (0, 0, 1) -- (0, 2, 1);
  \draw[dashed] (0, 0, 1) -- (2, 0, 1);
  \draw[dashed] (1, 0, 0) -- (1, 0 , 2);
  \draw (1, 2, 0) -- (1, 2, 2) -- (1, 0, 2);
  \draw (0, 2, 1) -- (2, 2, 1) -- (2, 0, 1);
  \end{tikzpicture}
  \end{center}
  #+end_export

- \(B_3\)
  \-
  #+begin_export latex
  \begin{center}
  \begin{tikzpicture}
  \draw[dashed] (0, 0, 0) -- (0, 2, 0);
  \draw[dashed] (0, 0, 0) -- (0, 0, 2);
  \draw[dashed] (0, 0, 0) -- (2, 0, 0);
  \draw[dashed] (0, 0, 1) -- (0, 2, 1);
  \draw[dashed] (0, 0, 1) -- (1, 0, 1);
  \draw[dashed] (1, 0, 0) -- (1, 0, 2);
  \draw[dashed] (1, 0, 1) -- (1, 2, 1);
  \draw[dashed] (1, 1, 0) -- (1, 1, 2);
  \draw[dashed] (1, 0, 0) -- (1, 2, 0);
  \draw[dashed] (1, 1, 0) -- (2, 1, 0);
  \draw (0, 0, 2) -- (0, 2, 2) -- (0, 2, 0);
  \draw (0, 2, 0) -- (2, 2, 0) -- (2, 0, 0) -- (2, 0, 2) -- (0, 0, 2);
  \draw (2, 2, 2) -- (2, 0, 2);
  \draw (2, 2, 2) -- (2, 2, 0);
  \draw (2, 2, 2) -- (0, 2, 2);
  \draw (0, 2, 1) -- (1, 2, 1);
  \draw (1, 0, 2) -- (1, 2, 2) -- (1, 2, 0);
  \draw (1, 1, 2) -- (2, 1, 2) -- (2, 1, 0);
  \end{tikzpicture}
  \end{center}
  #+end_export

- \(B_4\)
  \-
  #+begin_export latex
  \begin{center}
  \begin{tikzpicture}
  \draw[dashed] (0, 0, 0) -- (0, 3, 0);
  \draw[dashed] (0, 0, 0) -- (0, 0, 2);
  \draw[dashed] (0, 0, 0) -- (2, 0, 0);
  \draw[dashed] (0, 2, 1) -- (0, 0, 1) -- (1, 0, 1) -- (1, 3, 1);
  \draw[dashed] (0, 2, 0) -- (0, 2, 2);
  \draw[dashed] (1, 0, 0) -- (1, 3, 0);
  \draw[dashed] (2, 1, 0) -- (1, 1, 0) -- (1, 1, 2);
  \draw[dashed] (1, 0, 0) -- (1, 0, 2);
  \draw[dashed] (1, 1, 1) -- (2, 1, 1);
  \draw[dashed] (0, 2, 1) -- (1, 2, 1);
  \draw[dashed] (0, 2, 0) -- (1, 2, 0) -- (1, 2, 2);
  \draw (0, 3, 0) -- (0, 3, 2) -- (0, 0, 2) -- (2, 0, 2) -- (2, 0, 0) -- (2, 3, 0) -- (0, 3, 0);
  \draw (1, 3, 0) -- (1, 3, 2) -- (1, 0, 2);
  \draw (0, 3, 2) -- (2, 3, 2) -- (2, 0, 2);
  \draw (1, 1, 2) -- (2, 1, 2) -- (2, 1, 0);
  \draw (0, 2, 2) -- (1, 2, 2);
  \draw (2, 3, 0) -- (2, 3, 2);
  \draw (1, 3, 1) -- (2, 3, 1) -- (2, 1, 1);
  \end{tikzpicture}
  \end{center}
  #+end_export

\[ S = 1 + (2B_1 + B_2 + 4B_3 + 4\sum_{i = 0}^\infty(B_4B_5^i) )S \], \(B_5\) --- два вертикальных блока
\[ S = 1 + (2t^2 + t^4 + 4 t^4 + 4\sum_{i = 0}^\infty(t^{6 + 2i}))S \]
\[ S = \frac{1}{1 - 2t^2 - 5t^4 - 4\sum_{i = 0}^\infty(t^{6 + 2i})} \]
\[ S = \frac{1}{1 - 2t^2 - 5t^4 - 4\cdot\frac{t^6}{1 - t^2}} \]
\[ S = \frac{1 - t^2}{1 - t^2 - 2t^2 + 2t^4 - 5t^4 + 5t^6 - 4t^6} \]
\[ S = \frac{1 - t^2}{1 - 3t^2 - 3t^4 + t^6} \]


