Term4/discrete/hw/56.tex
% Created 2021-03-10 Wed 12:35
% Intended LaTeX compiler: pdflatex
\documentclass[english]{article}
\usepackage[T1, T2A]{fontenc}
\usepackage[lutf8]{luainputenc}
\usepackage[english, russian]{babel}
\usepackage{minted}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{hyperref}
\usepackage{xcolor}
\usepackage{natbib}
\usepackage{amssymb}
\usepackage{stmaryrd}
\usepackage{amsmath}
\usepackage{caption}
\usepackage{mathtools}
\usepackage{amsthm}
\usepackage{tikz}
\usepackage{grffile}
\usepackage{extarrows}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage{placeins}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{capt-of}

\usepackage{geometry}
\geometry{a4paper,left=2.5cm,top=2cm,right=2.5cm,bottom=2cm,marginparsep=7pt, marginparwidth=.6in}

 \usepackage{hyperref}
 \hypersetup{
     colorlinks=true,
     linkcolor=blue,
     filecolor=orange,
     citecolor=black,      
     urlcolor=cyan,
     }

\usetikzlibrary{decorations.markings}
\usetikzlibrary{cd}
\usetikzlibrary{patterns}

\newcommand\addtag{\refstepcounter{equation}\tag{\theequation}}
\newcommand{\eqrefoffset}[1]{\addtocounter{equation}{-#1}(\arabic{equation}\addtocounter{equation}{#1})}


\newcommand{\R}{\mathbb{R}}
\renewcommand{\C}{\mathbb{C}}
\newcommand{\N}{\mathbb{N}}
\newcommand{\rank}{\text{rank}}
\newcommand{\const}{\text{const}}
\newcommand{\grad}{\text{grad}}

\theoremstyle{plain}
\newtheorem{axiom}{Аксиома}
\newtheorem{lemma}{Лемма}
\newtheorem{manuallemmainner}{Лемма}
\newenvironment{manuallemma}[1]{%
  \renewcommand\themanuallemmainner{#1}%
  \manuallemmainner
}{\endmanuallemmainner}

\theoremstyle{remark}
\newtheorem*{remark}{Примечание}
\newtheorem*{solution}{Решение}
\newtheorem{corollary}{Следствие}[theorem]
\newtheorem*{examp}{Пример}
\newtheorem*{observation}{Наблюдение}

\theoremstyle{definition}
\newtheorem{task}{Задача}
\newtheorem{theorem}{Теорема}[section]
\newtheorem*{definition}{Определение}
\newtheorem*{symb}{Обозначение}
\newtheorem{manualtheoreminner}{Теорема}
\newenvironment{manualtheorem}[1]{%
  \renewcommand\themanualtheoreminner{#1}%
  \manualtheoreminner
}{\endmanualtheoreminner}
\captionsetup{justification=centering,margin=2cm}
\newenvironment{colored}[1]{\color{#1}}{}

\tikzset{->-/.style={decoration={
  markings,
  mark=at position .5 with {\arrow{>}}},postaction={decorate}}}
\makeatletter
\newcommand*{\relrelbarsep}{.386ex}
\newcommand*{\relrelbar}{%
  \mathrel{%
    \mathpalette\@relrelbar\relrelbarsep
  }%
}
\newcommand*{\@relrelbar}[2]{%
  \raise#2\hbox to 0pt{$\m@th#1\relbar$\hss}%
  \lower#2\hbox{$\m@th#1\relbar$}%
}
\providecommand*{\rightrightarrowsfill@}{%
  \arrowfill@\relrelbar\relrelbar\rightrightarrows
}
\providecommand*{\leftleftarrowsfill@}{%
  \arrowfill@\leftleftarrows\relrelbar\relrelbar
}
\providecommand*{\xrightrightarrows}[2][]{%
  \ext@arrow 0359\rightrightarrowsfill@{#1}{#2}%
}
\providecommand*{\xleftleftarrows}[2][]{%
  \ext@arrow 3095\leftleftarrowsfill@{#1}{#2}%
}
\makeatother
\author{Ilya Yaroshevskiy}
\date{\today}
\title{56}
\hypersetup{
 pdfauthor={Ilya Yaroshevskiy},
 pdftitle={56},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.0.50 (Org mode )}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\begin{itemize}
\item \(B_1\)
\-
\begin{center}
\begin{tikzpicture}
\draw[dashed] (0, 0, 0) -- (0, 1, 0);
\draw[dashed] (0, 0, 0) -- (0, 0, 2);
\draw[dashed] (0, 0, 0) -- (2, 0, 0);
\draw (0, 1, 0) -- (2, 1, 0);
\draw (0, 1, 0) -- (0, 1, 2);
\draw (0, 1, 2) -- (0, 0, 2);
\draw (0, 0, 2) -- (2, 0, 2);
\draw (2, 0, 2) -- (2, 1, 2);
\draw (2, 1, 2) -- (0, 1, 2);
\draw (2, 1, 2) -- (2, 1, 0);
\draw (2, 0, 2) -- (2, 0, 0);
\draw (2, 0, 0) -- (2, 1, 0);
\draw[dashed] (1, 0, 0) -- (1, 1, 0);
\draw[dashed] (1, 0, 0) -- (1, 0, 2);
\draw (1, 0, 2) -- (1, 1, 2);
\draw (1, 1, 2) -- (1, 1, 0);
\end{tikzpicture}
\end{center}

\item \(B_2\)
\-
\begin{center}
\begin{tikzpicture}
\draw[dashed] (0, 0, 0) -- (0, 2, 0);
\draw[dashed] (0, 0, 0) -- (0, 0, 2);
\draw[dashed] (0, 0, 0) -- (2, 0, 0);
\draw (0, 2, 0) -- (0, 2, 2) -- (0, 0, 2) -- (2, 0, 2) -- (2, 0, 0) -- (2, 2, 0) -- (0, 2, 0);
\draw (2, 2, 2) -- (2, 0 , 2);
\draw (2, 2, 2) -- (0, 2 , 2);
\draw (2, 2, 2) -- (2, 2 , 0);
\draw[dashed] (1, 0, 0) -- (1, 2, 0);
\draw[dashed] (0, 0, 1) -- (0, 2, 1);
\draw[dashed] (0, 0, 1) -- (2, 0, 1);
\draw[dashed] (1, 0, 0) -- (1, 0 , 2);
\draw (1, 2, 0) -- (1, 2, 2) -- (1, 0, 2);
\draw (0, 2, 1) -- (2, 2, 1) -- (2, 0, 1);
\end{tikzpicture}
\end{center}

\item \(B_3\)
\-
\begin{center}
\begin{tikzpicture}
\draw[dashed] (0, 0, 0) -- (0, 2, 0);
\draw[dashed] (0, 0, 0) -- (0, 0, 2);
\draw[dashed] (0, 0, 0) -- (2, 0, 0);
\draw[dashed] (0, 0, 1) -- (0, 2, 1);
\draw[dashed] (0, 0, 1) -- (1, 0, 1);
\draw[dashed] (1, 0, 0) -- (1, 0, 2);
\draw[dashed] (1, 0, 1) -- (1, 2, 1);
\draw[dashed] (1, 1, 0) -- (1, 1, 2);
\draw[dashed] (1, 0, 0) -- (1, 2, 0);
\draw[dashed] (1, 1, 0) -- (2, 1, 0);
\draw (0, 0, 2) -- (0, 2, 2) -- (0, 2, 0);
\draw (0, 2, 0) -- (2, 2, 0) -- (2, 0, 0) -- (2, 0, 2) -- (0, 0, 2);
\draw (2, 2, 2) -- (2, 0, 2);
\draw (2, 2, 2) -- (2, 2, 0);
\draw (2, 2, 2) -- (0, 2, 2);
\draw (0, 2, 1) -- (1, 2, 1);
\draw (1, 0, 2) -- (1, 2, 2) -- (1, 2, 0);
\draw (1, 1, 2) -- (2, 1, 2) -- (2, 1, 0);
\end{tikzpicture}
\end{center}

\item \(B_4\)
\-
\begin{center}
\begin{tikzpicture}
\draw[dashed] (0, 0, 0) -- (0, 3, 0);
\draw[dashed] (0, 0, 0) -- (0, 0, 2);
\draw[dashed] (0, 0, 0) -- (2, 0, 0);
\draw[dashed] (0, 2, 1) -- (0, 0, 1) -- (1, 0, 1) -- (1, 3, 1);
\draw[dashed] (0, 2, 0) -- (0, 2, 2);
\draw[dashed] (1, 0, 0) -- (1, 3, 0);
\draw[dashed] (2, 1, 0) -- (1, 1, 0) -- (1, 1, 2);
\draw[dashed] (1, 0, 0) -- (1, 0, 2);
\draw[dashed] (1, 1, 1) -- (2, 1, 1);
\draw[dashed] (0, 2, 1) -- (1, 2, 1);
\draw[dashed] (0, 2, 0) -- (1, 2, 0) -- (1, 2, 2);
\draw (0, 3, 0) -- (0, 3, 2) -- (0, 0, 2) -- (2, 0, 2) -- (2, 0, 0) -- (2, 3, 0) -- (0, 3, 0);
\draw (1, 3, 0) -- (1, 3, 2) -- (1, 0, 2);
\draw (0, 3, 2) -- (2, 3, 2) -- (2, 0, 2);
\draw (1, 1, 2) -- (2, 1, 2) -- (2, 1, 0);
\draw (0, 2, 2) -- (1, 2, 2);
\draw (2, 3, 0) -- (2, 3, 2);
\draw (1, 3, 1) -- (2, 3, 1) -- (2, 1, 1);
\end{tikzpicture}
\end{center}
\end{itemize}

\[ S = 1 + (2B_1 + B_2 + 4B_3 + 4\sum_{i = 0}^\infty(B_4B_5^i) )S \], \(B_5\) --- два вертикальных блока
\[ S = 1 + (2t^2 + t^4 + 4 t^4 + 4\sum_{i = 0}^\infty(t^{6 + 2i}))S \]
\[ S = \frac{1}{1 - 2t^2 - 5t^4 - 4\sum_{i = 0}^\infty(t^{6 + 2i})} \]
\[ S = \frac{1}{1 - 2t^2 - 5t^4 - 4\cdot\frac{t^6}{1 - t^2}} \]
\[ S = \frac{1 - t^2}{1 - t^2 - 2t^2 + 2t^4 - 5t^4 + 5t^6 - 4t^6} \]
\[ S = \frac{1 - t^2}{1 - 3t^2 - 3t^4 + t^6} \]
\end{document}
